#+TITLE: 5.Branches

*** Listing Branches

#+BEGIN_SRC shell
git branch
#+END_SRC

#+RESULTS:
| *      | develop |
| master |         |

The master branch is Git’s default branch, which is created with the first commit
in any repository. Many developers use this branch as the “main” history of the
project—a permanent branch that contains every major change it goes through.

